###################################################################

# Created by write_sdc on Wed Apr 22 10:45:54 2020

###################################################################
set sdc_version 1.4

set_operating_conditions u055lscee12bpl_108c125_wc -library                    \
u055lscee12bpl_108c125_wc
set_wire_load_mode enclosed
set_wire_load_model -name wl10 -library u055lscee12bpr_120c25_tc
set_max_transition 1.5 [current_design]
set_max_fanout 10 [current_design]
set_max_area 0
set_load -pin_load 0.41 [get_ports {prdata[31]}]
set_load -pin_load 0.41 [get_ports {prdata[30]}]
set_load -pin_load 0.41 [get_ports {prdata[29]}]
set_load -pin_load 0.41 [get_ports {prdata[28]}]
set_load -pin_load 0.41 [get_ports {prdata[27]}]
set_load -pin_load 0.41 [get_ports {prdata[26]}]
set_load -pin_load 0.41 [get_ports {prdata[25]}]
set_load -pin_load 0.41 [get_ports {prdata[24]}]
set_load -pin_load 0.41 [get_ports {prdata[23]}]
set_load -pin_load 0.41 [get_ports {prdata[22]}]
set_load -pin_load 0.41 [get_ports {prdata[21]}]
set_load -pin_load 0.41 [get_ports {prdata[20]}]
set_load -pin_load 0.41 [get_ports {prdata[19]}]
set_load -pin_load 0.41 [get_ports {prdata[18]}]
set_load -pin_load 0.41 [get_ports {prdata[17]}]
set_load -pin_load 0.41 [get_ports {prdata[16]}]
set_load -pin_load 0.41 [get_ports {prdata[15]}]
set_load -pin_load 0.41 [get_ports {prdata[14]}]
set_load -pin_load 0.41 [get_ports {prdata[13]}]
set_load -pin_load 0.41 [get_ports {prdata[12]}]
set_load -pin_load 0.41 [get_ports {prdata[11]}]
set_load -pin_load 0.41 [get_ports {prdata[10]}]
set_load -pin_load 0.41 [get_ports {prdata[9]}]
set_load -pin_load 0.41 [get_ports {prdata[8]}]
set_load -pin_load 0.41 [get_ports {prdata[7]}]
set_load -pin_load 0.41 [get_ports {prdata[6]}]
set_load -pin_load 0.41 [get_ports {prdata[5]}]
set_load -pin_load 0.41 [get_ports {prdata[4]}]
set_load -pin_load 0.41 [get_ports {prdata[3]}]
set_load -pin_load 0.41 [get_ports {prdata[2]}]
set_load -pin_load 0.41 [get_ports {prdata[1]}]
set_load -pin_load 0.41 [get_ports {prdata[0]}]
set_load -pin_load 0.41 [get_ports pready]
set_load -pin_load 0.41 [get_ports pslverr]
set_load -pin_load 0.41 [get_ports trgo]
set_load -pin_load 0.41 [get_ports trgo_dac]
set_load -pin_load 0.41 [get_ports timx_ud_dma]
set_load -pin_load 0.41 [get_ports timx_ud_int]
set_input_transition -max 0.6  [get_ports btim_clk]
set_input_transition -min 0.6  [get_ports btim_clk]
set_input_transition -max 0.6  [get_ports pclk]
set_input_transition -min 0.6  [get_ports pclk]
set_input_transition -max 0.6  [get_ports btim_en]
set_input_transition -min 0.6  [get_ports btim_en]
set_input_transition -max 0.6  [get_ports btim_rstn]
set_input_transition -min 0.6  [get_ports btim_rstn]
set_input_transition -max 0.6  [get_ports presetn]
set_input_transition -min 0.6  [get_ports presetn]
set_input_transition -max 0.6  [get_ports {paddr[31]}]
set_input_transition -min 0.6  [get_ports {paddr[31]}]
set_input_transition -max 0.6  [get_ports {paddr[30]}]
set_input_transition -min 0.6  [get_ports {paddr[30]}]
set_input_transition -max 0.6  [get_ports {paddr[29]}]
set_input_transition -min 0.6  [get_ports {paddr[29]}]
set_input_transition -max 0.6  [get_ports {paddr[28]}]
set_input_transition -min 0.6  [get_ports {paddr[28]}]
set_input_transition -max 0.6  [get_ports {paddr[27]}]
set_input_transition -min 0.6  [get_ports {paddr[27]}]
set_input_transition -max 0.6  [get_ports {paddr[26]}]
set_input_transition -min 0.6  [get_ports {paddr[26]}]
set_input_transition -max 0.6  [get_ports {paddr[25]}]
set_input_transition -min 0.6  [get_ports {paddr[25]}]
set_input_transition -max 0.6  [get_ports {paddr[24]}]
set_input_transition -min 0.6  [get_ports {paddr[24]}]
set_input_transition -max 0.6  [get_ports {paddr[23]}]
set_input_transition -min 0.6  [get_ports {paddr[23]}]
set_input_transition -max 0.6  [get_ports {paddr[22]}]
set_input_transition -min 0.6  [get_ports {paddr[22]}]
set_input_transition -max 0.6  [get_ports {paddr[21]}]
set_input_transition -min 0.6  [get_ports {paddr[21]}]
set_input_transition -max 0.6  [get_ports {paddr[20]}]
set_input_transition -min 0.6  [get_ports {paddr[20]}]
set_input_transition -max 0.6  [get_ports {paddr[19]}]
set_input_transition -min 0.6  [get_ports {paddr[19]}]
set_input_transition -max 0.6  [get_ports {paddr[18]}]
set_input_transition -min 0.6  [get_ports {paddr[18]}]
set_input_transition -max 0.6  [get_ports {paddr[17]}]
set_input_transition -min 0.6  [get_ports {paddr[17]}]
set_input_transition -max 0.6  [get_ports {paddr[16]}]
set_input_transition -min 0.6  [get_ports {paddr[16]}]
set_input_transition -max 0.6  [get_ports {paddr[15]}]
set_input_transition -min 0.6  [get_ports {paddr[15]}]
set_input_transition -max 0.6  [get_ports {paddr[14]}]
set_input_transition -min 0.6  [get_ports {paddr[14]}]
set_input_transition -max 0.6  [get_ports {paddr[13]}]
set_input_transition -min 0.6  [get_ports {paddr[13]}]
set_input_transition -max 0.6  [get_ports {paddr[12]}]
set_input_transition -min 0.6  [get_ports {paddr[12]}]
set_input_transition -max 0.6  [get_ports {paddr[11]}]
set_input_transition -min 0.6  [get_ports {paddr[11]}]
set_input_transition -max 0.6  [get_ports {paddr[10]}]
set_input_transition -min 0.6  [get_ports {paddr[10]}]
set_input_transition -max 0.6  [get_ports {paddr[9]}]
set_input_transition -min 0.6  [get_ports {paddr[9]}]
set_input_transition -max 0.6  [get_ports {paddr[8]}]
set_input_transition -min 0.6  [get_ports {paddr[8]}]
set_input_transition -max 0.6  [get_ports {paddr[7]}]
set_input_transition -min 0.6  [get_ports {paddr[7]}]
set_input_transition -max 0.6  [get_ports {paddr[6]}]
set_input_transition -min 0.6  [get_ports {paddr[6]}]
set_input_transition -max 0.6  [get_ports {paddr[5]}]
set_input_transition -min 0.6  [get_ports {paddr[5]}]
set_input_transition -max 0.6  [get_ports {paddr[4]}]
set_input_transition -min 0.6  [get_ports {paddr[4]}]
set_input_transition -max 0.6  [get_ports {paddr[3]}]
set_input_transition -min 0.6  [get_ports {paddr[3]}]
set_input_transition -max 0.6  [get_ports {paddr[2]}]
set_input_transition -min 0.6  [get_ports {paddr[2]}]
set_input_transition -max 0.6  [get_ports {paddr[1]}]
set_input_transition -min 0.6  [get_ports {paddr[1]}]
set_input_transition -max 0.6  [get_ports {paddr[0]}]
set_input_transition -min 0.6  [get_ports {paddr[0]}]
set_input_transition -max 0.6  [get_ports psel]
set_input_transition -min 0.6  [get_ports psel]
set_input_transition -max 0.6  [get_ports penable]
set_input_transition -min 0.6  [get_ports penable]
set_input_transition -max 0.6  [get_ports pwrite]
set_input_transition -min 0.6  [get_ports pwrite]
set_input_transition -max 0.6  [get_ports {pwdata[31]}]
set_input_transition -min 0.6  [get_ports {pwdata[31]}]
set_input_transition -max 0.6  [get_ports {pwdata[30]}]
set_input_transition -min 0.6  [get_ports {pwdata[30]}]
set_input_transition -max 0.6  [get_ports {pwdata[29]}]
set_input_transition -min 0.6  [get_ports {pwdata[29]}]
set_input_transition -max 0.6  [get_ports {pwdata[28]}]
set_input_transition -min 0.6  [get_ports {pwdata[28]}]
set_input_transition -max 0.6  [get_ports {pwdata[27]}]
set_input_transition -min 0.6  [get_ports {pwdata[27]}]
set_input_transition -max 0.6  [get_ports {pwdata[26]}]
set_input_transition -min 0.6  [get_ports {pwdata[26]}]
set_input_transition -max 0.6  [get_ports {pwdata[25]}]
set_input_transition -min 0.6  [get_ports {pwdata[25]}]
set_input_transition -max 0.6  [get_ports {pwdata[24]}]
set_input_transition -min 0.6  [get_ports {pwdata[24]}]
set_input_transition -max 0.6  [get_ports {pwdata[23]}]
set_input_transition -min 0.6  [get_ports {pwdata[23]}]
set_input_transition -max 0.6  [get_ports {pwdata[22]}]
set_input_transition -min 0.6  [get_ports {pwdata[22]}]
set_input_transition -max 0.6  [get_ports {pwdata[21]}]
set_input_transition -min 0.6  [get_ports {pwdata[21]}]
set_input_transition -max 0.6  [get_ports {pwdata[20]}]
set_input_transition -min 0.6  [get_ports {pwdata[20]}]
set_input_transition -max 0.6  [get_ports {pwdata[19]}]
set_input_transition -min 0.6  [get_ports {pwdata[19]}]
set_input_transition -max 0.6  [get_ports {pwdata[18]}]
set_input_transition -min 0.6  [get_ports {pwdata[18]}]
set_input_transition -max 0.6  [get_ports {pwdata[17]}]
set_input_transition -min 0.6  [get_ports {pwdata[17]}]
set_input_transition -max 0.6  [get_ports {pwdata[16]}]
set_input_transition -min 0.6  [get_ports {pwdata[16]}]
set_input_transition -max 0.6  [get_ports {pwdata[15]}]
set_input_transition -min 0.6  [get_ports {pwdata[15]}]
set_input_transition -max 0.6  [get_ports {pwdata[14]}]
set_input_transition -min 0.6  [get_ports {pwdata[14]}]
set_input_transition -max 0.6  [get_ports {pwdata[13]}]
set_input_transition -min 0.6  [get_ports {pwdata[13]}]
set_input_transition -max 0.6  [get_ports {pwdata[12]}]
set_input_transition -min 0.6  [get_ports {pwdata[12]}]
set_input_transition -max 0.6  [get_ports {pwdata[11]}]
set_input_transition -min 0.6  [get_ports {pwdata[11]}]
set_input_transition -max 0.6  [get_ports {pwdata[10]}]
set_input_transition -min 0.6  [get_ports {pwdata[10]}]
set_input_transition -max 0.6  [get_ports {pwdata[9]}]
set_input_transition -min 0.6  [get_ports {pwdata[9]}]
set_input_transition -max 0.6  [get_ports {pwdata[8]}]
set_input_transition -min 0.6  [get_ports {pwdata[8]}]
set_input_transition -max 0.6  [get_ports {pwdata[7]}]
set_input_transition -min 0.6  [get_ports {pwdata[7]}]
set_input_transition -max 0.6  [get_ports {pwdata[6]}]
set_input_transition -min 0.6  [get_ports {pwdata[6]}]
set_input_transition -max 0.6  [get_ports {pwdata[5]}]
set_input_transition -min 0.6  [get_ports {pwdata[5]}]
set_input_transition -max 0.6  [get_ports {pwdata[4]}]
set_input_transition -min 0.6  [get_ports {pwdata[4]}]
set_input_transition -max 0.6  [get_ports {pwdata[3]}]
set_input_transition -min 0.6  [get_ports {pwdata[3]}]
set_input_transition -max 0.6  [get_ports {pwdata[2]}]
set_input_transition -min 0.6  [get_ports {pwdata[2]}]
set_input_transition -max 0.6  [get_ports {pwdata[1]}]
set_input_transition -min 0.6  [get_ports {pwdata[1]}]
set_input_transition -max 0.6  [get_ports {pwdata[0]}]
set_input_transition -min 0.6  [get_ports {pwdata[0]}]
set_input_transition -max 0.6  [get_ports dbg_timx_stop]
set_input_transition -min 0.6  [get_ports dbg_timx_stop]
set_input_transition -max 0.6  [get_ports core_halt]
set_input_transition -min 0.6  [get_ports core_halt]
set_input_transition -max 0.6  [get_ports timx_dma_ack]
set_input_transition -min 0.6  [get_ports timx_dma_ack]
set_clock_gating_check -rise -setup 0.3 [get_cells                             \
basic_tim_counter_u/clk_gate_dac_cnt_r_reg/main_gate]
set_clock_gating_check -fall -setup 0.3 [get_cells                             \
basic_tim_counter_u/clk_gate_dac_cnt_r_reg/main_gate]
set_clock_gating_check -rise -hold 0.2 [get_cells                              \
basic_tim_counter_u/clk_gate_dac_cnt_r_reg/main_gate]
set_clock_gating_check -fall -hold 0.2 [get_cells                              \
basic_tim_counter_u/clk_gate_dac_cnt_r_reg/main_gate]
set_clock_gating_check -rise -setup 0.3 [get_cells                             \
basic_tim_counter_u/clk_gate_timx_arr_shd_r_reg/main_gate]
set_clock_gating_check -fall -setup 0.3 [get_cells                             \
basic_tim_counter_u/clk_gate_timx_arr_shd_r_reg/main_gate]
set_clock_gating_check -rise -hold 0.2 [get_cells                              \
basic_tim_counter_u/clk_gate_timx_arr_shd_r_reg/main_gate]
set_clock_gating_check -fall -hold 0.2 [get_cells                              \
basic_tim_counter_u/clk_gate_timx_arr_shd_r_reg/main_gate]
set_clock_gating_check -rise -setup 0.3 [get_cells                             \
basic_tim_counter_u/clk_gate_psc_cnt_r_reg/main_gate]
set_clock_gating_check -fall -setup 0.3 [get_cells                             \
basic_tim_counter_u/clk_gate_psc_cnt_r_reg/main_gate]
set_clock_gating_check -rise -hold 0.2 [get_cells                              \
basic_tim_counter_u/clk_gate_psc_cnt_r_reg/main_gate]
set_clock_gating_check -fall -hold 0.2 [get_cells                              \
basic_tim_counter_u/clk_gate_psc_cnt_r_reg/main_gate]
set_clock_gating_check -rise -setup 0.3 [get_cells                             \
basic_tim_counter_u/clk_gate_timx_psc_shd_r_reg/main_gate]
set_clock_gating_check -fall -setup 0.3 [get_cells                             \
basic_tim_counter_u/clk_gate_timx_psc_shd_r_reg/main_gate]
set_clock_gating_check -rise -hold 0.2 [get_cells                              \
basic_tim_counter_u/clk_gate_timx_psc_shd_r_reg/main_gate]
set_clock_gating_check -fall -hold 0.2 [get_cells                              \
basic_tim_counter_u/clk_gate_timx_psc_shd_r_reg/main_gate]
set_clock_gating_check -rise -setup 0.3 [get_cells                             \
basic_tim_counter_u/clk_gate_timx_cnt_reg/main_gate]
set_clock_gating_check -fall -setup 0.3 [get_cells                             \
basic_tim_counter_u/clk_gate_timx_cnt_reg/main_gate]
set_clock_gating_check -rise -hold 0.2 [get_cells                              \
basic_tim_counter_u/clk_gate_timx_cnt_reg/main_gate]
set_clock_gating_check -fall -hold 0.2 [get_cells                              \
basic_tim_counter_u/clk_gate_timx_cnt_reg/main_gate]
set_clock_gating_check -rise -setup 0.3 [get_cells                             \
basic_tim_reg_u/clk_gate_genblk1_timx_or_r_reg/main_gate]
set_clock_gating_check -fall -setup 0.3 [get_cells                             \
basic_tim_reg_u/clk_gate_genblk1_timx_or_r_reg/main_gate]
set_clock_gating_check -rise -hold 0.2 [get_cells                              \
basic_tim_reg_u/clk_gate_genblk1_timx_or_r_reg/main_gate]
set_clock_gating_check -fall -hold 0.2 [get_cells                              \
basic_tim_reg_u/clk_gate_genblk1_timx_or_r_reg/main_gate]
set_clock_gating_check -rise -setup 0.3 [get_cells                             \
basic_tim_reg_u/clk_gate_genblk1_timx_cr2_r_reg/main_gate]
set_clock_gating_check -fall -setup 0.3 [get_cells                             \
basic_tim_reg_u/clk_gate_genblk1_timx_cr2_r_reg/main_gate]
set_clock_gating_check -rise -hold 0.2 [get_cells                              \
basic_tim_reg_u/clk_gate_genblk1_timx_cr2_r_reg/main_gate]
set_clock_gating_check -fall -hold 0.2 [get_cells                              \
basic_tim_reg_u/clk_gate_genblk1_timx_cr2_r_reg/main_gate]
set_clock_gating_check -rise -setup 0.3 [get_cells                             \
basic_tim_reg_u/clk_gate_genblk1_timx_cr1_r_reg/main_gate]
set_clock_gating_check -fall -setup 0.3 [get_cells                             \
basic_tim_reg_u/clk_gate_genblk1_timx_cr1_r_reg/main_gate]
set_clock_gating_check -rise -hold 0.2 [get_cells                              \
basic_tim_reg_u/clk_gate_genblk1_timx_cr1_r_reg/main_gate]
set_clock_gating_check -fall -hold 0.2 [get_cells                              \
basic_tim_reg_u/clk_gate_genblk1_timx_cr1_r_reg/main_gate]
set_clock_gating_check -rise -setup 0.3 [get_cells                             \
basic_tim_reg_u/clk_gate_genblk1_timx_arr_r_reg/main_gate]
set_clock_gating_check -fall -setup 0.3 [get_cells                             \
basic_tim_reg_u/clk_gate_genblk1_timx_arr_r_reg/main_gate]
set_clock_gating_check -rise -hold 0.2 [get_cells                              \
basic_tim_reg_u/clk_gate_genblk1_timx_arr_r_reg/main_gate]
set_clock_gating_check -fall -hold 0.2 [get_cells                              \
basic_tim_reg_u/clk_gate_genblk1_timx_arr_r_reg/main_gate]
set_clock_gating_check -rise -setup 0.3 [get_cells                             \
basic_tim_reg_u/clk_gate_genblk1_timx_psc_r_reg/main_gate]
set_clock_gating_check -fall -setup 0.3 [get_cells                             \
basic_tim_reg_u/clk_gate_genblk1_timx_psc_r_reg/main_gate]
set_clock_gating_check -rise -hold 0.2 [get_cells                              \
basic_tim_reg_u/clk_gate_genblk1_timx_psc_r_reg/main_gate]
set_clock_gating_check -fall -hold 0.2 [get_cells                              \
basic_tim_reg_u/clk_gate_genblk1_timx_psc_r_reg/main_gate]
