#---------------------------------------------------------------------
#  author   : hr_li
#  data     : 2020/3/1
#  function : run dc script
#---------------------------------------------------------------------

#---------------------------------------------------------------------
#  set core number
#---------------------------------------------------------------------
set_host_options -max_cores 16

#---------------------------------------------------------------------
#  set word path and svf file
#---------------------------------------------------------------------
define_design_lib WORK -path ./work
set_svf  ../../out/$RTL_TOP_FILE.svf

#---------------------------------------------------------------------
#  source rtl.tcl
#---------------------------------------------------------------------
source  ../../scr/rtl.tcl
source  ../../scr/lib.tcl

#---------------------------------------------------------------------
#  set search_path
#---------------------------------------------------------------------
set  search_path        [list $LIB_PATH $INC_PATH]

#---------------------------------------------------------------------
#  set synthetic_library
#---------------------------------------------------------------------
set  target_library     [list $LIB_FILE]
set  synthetic_library  [list standard.sldb dw_foundation.sldb]
set  link_library       [concat $target_library dw_foundation.sldb]

#---------------------------------------------------------------------
#  read verilog
#---------------------------------------------------------------------
analyze -format verilog $FILELIST

#---------------------------------------------------------------------
#  read verilog
#---------------------------------------------------------------------
elaborate $RTL_TOP_FILE -architecture verilog

#---------------------------------------------------------------------
#  set top
#---------------------------------------------------------------------
if { $RTL_TOP_FILE == "" } {
	echo "no top file defined, dc current_design error"
	exit
} else {
	current_design $RTL_TOP_FILE
}

#---------------------------------------------------------------------
#  link operation
#---------------------------------------------------------------------
if { [link] == 0 } {
	echo "link with error!"
	exit
}

#---------------------------------------------------------------------
#  check design operation
#---------------------------------------------------------------------
if { [check_design] == 0 } {
	echo "check design with error!"
	exit
}

#---------------------------------------------------------------------
#  operate compile
#---------------------------------------------------------------------
compile_ultra

#---------------------------------------------------------------------
#  output netlist
#---------------------------------------------------------------------
write -format verilog -hierarchy -output ../../out/$RTL_TOP_FILE.v

#---------------------------------------------------------------------
#  exit dc
#---------------------------------------------------------------------
quit

